from django import forms
from .models import D31Info

class MonthForm(forms.Form):
    SELECTION1=[(0,'--'),(1,'1'),(2,'2'),(3,'3'),(4,'4'),(5,'5'),(6,'6'),(7,'7'),(8,'8'),(9,'9'),(10,'10'),(11,'11'),(12,'12')]
    month = forms.ChoiceField(label = '月',choices=SELECTION1)

class CheckForm(forms.ModelForm):
    class Meta:
        model = D31Info
        fields = ('yasumi','month','status','form')
        labels = {
            'yasumi':'希望休',
            'month':'月',
            'status':'状態',
            'form':'フォーム内容'
        }

class D31Form(forms.Form):
    OPTIONS = (
        ("1", "1"),
        ("2", "2"),
        ("3", "3"),
        ("4", "4"),
        ("5", "5"),
        ("6", "6"),
        ("7", "7"),
        ("8", "8"),
        ("9", "9"),
        ("10", "10"),
        ("11", "11"),
        ("12", "12"),
        ("13", "13"),
        ("14", "14"),
        ("15", "15"),
        ("16", "16"),
        ("17", "17"),
        ("18", "18"),
        ("19", "19"),
        ("20", "20"),
        ("21", "21"),
        ("22", "22"),
        ("23", "23"),
        ("24", "24"),
        ("25", "25"),
        ("26", "26"),
        ("27", "27"),
        ("28", "28"),
        ("29", "29"),
        ("30", "30"),
        ("31", "31"),
    )
    SELECTION1=[(0,'--'),(1,'1'),(2,'2'),(3,'3'),(4,'4'),(5,'5'),(6,'6'),(7,'7'),(8,'8'),(9,'9'),(10,'10'),(11,'11'),(12,'12')]
    month = forms.ChoiceField(label = '月',choices=SELECTION1)    
    Kiboukyuu = forms.MultipleChoiceField(label='希望休',widget=forms.CheckboxSelectMultiple, choices=OPTIONS)
    
class D30Form(forms.Form):
    OPTIONS = (
        ("1", "1"),
        ("2", "2"),
        ("3", "3"),
        ("4", "4"),
        ("5", "5"),
        ("6", "6"),
        ("7", "7"),
        ("8", "8"),
        ("9", "9"),
        ("10", "10"),
        ("11", "11"),
        ("12", "12"),
        ("13", "13"),
        ("14", "14"),
        ("15", "15"),
        ("16", "16"),
        ("17", "17"),
        ("18", "18"),
        ("19", "19"),
        ("20", "20"),
        ("21", "21"),
        ("22", "22"),
        ("23", "23"),
        ("24", "24"),
        ("25", "25"),
        ("26", "26"),
        ("27", "27"),
        ("28", "28"),
        ("29", "29"),
        ("30", "30"),
    )
    SELECTION1=[(0,'--'),(1,'1'),(2,'2'),(3,'3'),(4,'4'),(5,'5'),(6,'6'),(7,'7'),(8,'8'),(9,'9'),(10,'10'),(11,'11'),(12,'12')]
    month = forms.ChoiceField(label = '月',choices=SELECTION1)    
    Kiboukyuu = forms.MultipleChoiceField(label='希望休',widget=forms.CheckboxSelectMultiple, choices=OPTIONS)

class D28Form(forms.Form):
    OPTIONS = (
        ("1", "1"),
        ("2", "2"),
        ("3", "3"),
        ("4", "4"),
        ("5", "5"),
        ("6", "6"),
        ("7", "7"),
        ("8", "8"),
        ("9", "9"),
        ("10", "10"),
        ("11", "11"),
        ("12", "12"),
        ("13", "13"),
        ("14", "14"),
        ("15", "15"),
        ("16", "16"),
        ("17", "17"),
        ("18", "18"),
        ("19", "19"),
        ("20", "20"),
        ("21", "21"),
        ("22", "22"),
        ("23", "23"),
        ("24", "24"),
        ("25", "25"),
        ("26", "26"),
        ("27", "27"),
        ("28", "28"),
    )
    SELECTION1=[(0,'--'),(1,'1'),(2,'2'),(3,'3'),(4,'4'),(5,'5'),(6,'6'),(7,'7'),(8,'8'),(9,'9'),(10,'10'),(11,'11'),(12,'12')]
    month = forms.ChoiceField(label = '月',choices=SELECTION1)    
    Kiboukyuu = forms.MultipleChoiceField(label='希望休',widget=forms.CheckboxSelectMultiple, choices=OPTIONS)
    